app/Models/TaskModel.php

SELECT *
FROM `task`
WHERE `user_id` = '12'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `user_id` = '12'
---
    public function paginateTasksByUserId($id)
    {
        return $this->where('user_id', $id)
                    ->paginate(5);

SELECT `id`, `description`
FROM `task`
WHERE `user_id` = '12'
AND  `description` LIKE '%tas%' ESCAPE '!'
---
    public function search($term, $user_id)
    {
        if ($term === null) {

            return [];
        }

        return $this->select('id, description')
                    ->where('user_id', $user_id)
                    ->like('description', $term)
                    ->get()
                    ->getResultArray();