app/Models/UserModel.php

    public function findByEmail($email)
    {
        return $this->where('email', $email)
                    ->first();
---
SELECT *
FROM `user`
WHERE `email` = 'email4@email.com'
 LIMIT 1